{
    "home": "Inicio",
    "profile": "Perfil",
    "cv": "CV (inglés)",
    "contact": "Contáctame",
    "profile.title.Professional": "Perfil",
    "profile.title.Profile": "Profesional",
    "app.title.softwareArchitect": "arquitecto de software",
    "app.title.webDeveloper": "desarrollador web",
    "app.title.mobileApps": "aplicaciones móviles",
    "app.title.fullStackEngineer": "Ingeniero Full Stack",
    "app.title.aiProcesses": "PROCESOS DE IA",
    "app.title.digitalTransformation": "Transformación Digital",
    "app.teaser.keywords": "Tecnología / Negocios / Programación / Arquitectura de Software / SEO / Desarrollo Full Stack / Aplicaciones Móviles / Procesos de IA y desarrollo",
    "app.teaser.contactIntro": "Si buscas un arquitecto programador que pueda cumplir tus expectativas de calidad y ofrecerte buenos bytes, no dudes en",
    "app.teaser.experience": "Experiencia:",
    "app.teaser.experienceYears": "+20 años",
    "app.teaser.projects": "Proyectos:",
    "app.teaser.projectsCount": "75",
    "app.teaser.linesOfCode": "Líneas de código:",
    "app.teaser.linesOfCodeCount": "7+ millones",
    "app.content.languagesTitle": "Lenguajes de Programación <span>Frameworks</span> &amp; Herramientas",
    "app.content.softwareArchitectTitle": "Arquitecto de Software <span>Web & Móvil</span> / Experto en APIs",
    "app.content.professionalDeveloperIntro": "Desarrollador profesional con +20 años de experiencia creando software. ",
    "app.content.professionalProgrammerExperience": "Como programador profesional, desarrollo exclusivamente para ti y tus necesidades de negocio. He trabajado en varios países que incluyen Reino Unido, Irlanda, Alemania, España y Sudamérica. He trabajado en más de 70 proyectos. Las empresas para las que he trabajado incluyen muchas industrias como educación, deportes, moda, viajes, música, telecomunicaciones y energía, en varios países, remotamente o en casa, como freelance o como empleado, en equipo o liderando como desarrollador senior.",
    "app.content.bilingualNote": "(Bilingüe en Inglés y Español)",
    "app.content.expertiseTitle": "Áreas de Especialización",
    "app.expertise.websites": "Sitios Web",
    "app.expertise.backEnd": "Back End",
    "app.expertise.frontEnd": "Front End",
    "app.expertise.apis": "APIs",
    "app.expertise.androidApps": "Aplicaciones Android",
    "app.expertise.hybridNativeApps": "Aplicaciones híbridas y nativas",
    "app.expertise.services": "Servicios",
    "app.expertise.libraries": "Librerías",
    "app.expertise.windowsDesktopApps": "Aplicaciones de escritorio Windows",
    "app.expertise.seo": "SEO",
    "app.expertise.databases": "Bases de Datos",
    "app.expertise.techConsultancy": "Consultoría Tecnológica",
    "app.expertise.internetPresence": "Presencia en Internet",
    "app.expertise.design": "Diseño",
    "app.expertise.architecture": "Arquitectura",
    "app.expertise.engineering": "Ingeniería",
    "app.expertise.projectManagement": "Gestión de Proyectos",
    "app.expertise.projectPlanning": "Planificación de Proyectos",
    "app.expertise.customerManagement": "Gestión de Clientes",
    "app.expertise.aiProcesses": "Procesos de IA",
    "app.expertise.etc": "Etc.",
    "app.content.profilePrompt": "Por favor visita mi",
    "app.content.profilePromptLink": "perfil",
    "app.content.profilePromptSuffix": "para encontrar más detalles sobre mí.",
    "app.sidebar.quotesTitle": "Qué dicen de mí",
    "app.sidebar.quote1": "Hay dos formas de construir un diseño de software: una es hacerlo tan simple que obviamente no haya deficiencias, y la otra es hacerlo tan complicado que no haya deficiencias obvias. El primer método es mucho más difícil.",
    "app.sidebar.author1": "—C.A.R. Hoare (científico informático británico, ganador del Premio Turing en 1980)",
    "app.sidebar.quote2": "Si la depuración es el proceso de eliminar errores de software, entonces la programación debe ser el proceso de introducirlos.",
    "app.sidebar.author2": "—Edsger Dijkstra (científico informático holandés, ganador del Premio Turing en 1972)",
    "app.sidebar.quote3": "Nueve personas no pueden hacer un bebé en un mes.",
    "app.sidebar.author3": "—Fred Brooks (científico informático estadounidense, ganador del Premio Turing en 1999)",
    "app.sidebar.quote4": "Programa siempre como si el tipo que terminará manteniendo tu código fuera un psicópata violento que sabe dónde vives.",
    "app.sidebar.author4": "—Martin Golding",
    "app.sidebar.quote5": "La mayoría de los buenos programadores programan no porque esperen que les paguen o que el público los adule, sino porque es divertido programar.",
    "app.sidebar.author5": "—Linus Torvalds (finlandés estadounidense, ingeniero de software y hacker, principal impulsor del desarrollo del kernel de Linux)",
    "contact.title": "Contáctame",
    "contact.intro": "Si quieres contactarme, por favor envíame un correo electrónico a:",
    "contact.linkedinPrompt": "También puedes encontrarme en LinkedIn:",
    "contact.githubPrompt": "O mira mis proyectos en GitHub:",
    "profile.experienceTitle": "Experiencia",
    "profile.experience1": "Arquitecto de Software en GoodBytes",
    "profile.experience2": "Desarrollador Full Stack en GoodBytes",
    "profile.educationTitle": "Educación",
    "profile.education1": "Máster en Informática",
    "profile.education2": "Grado en Informática",
    "profile.skillsTitle": "Habilidades",
    "profile.skills": "JavaScript, TypeScript, React, Angular, Node.js, Go, Docker, Kubernetes, AWS, Azure, SQL, NoSQL, etc.",
    "enLang": "Inglés",
    "esLang": "Español",
    "linkedinAlt": "LinkedIn",
    "githubAlt": "GitHub",
    "app.content.languagesTitlePart1": "Lenguajes",
    "app.content.languagesTitlePart2": "o frameworks que utilizo para mis proyectos",
    "app.sidebar.quotesTitlePart1": "Citas de Los mejores",
    "app.sidebar.quotesTitlePart2": "desarrolladores",
    "app.content.softwareArchitectTitlePart1": "Software Architect",
    "app.content.softwareArchitectTitlePart2": "Professional Websites Developer (full stack), Mobile apps",
    "app.content.expertiseTitlePart1": "tengo ",
    "app.content.expertiseTitlePart2": "Experiencia con",
    "profile.title": "Perfil",
    "profile.intro": "Soy un profesional enérgico y orientado a resultados con más de 20 años de experiencia en desarrollo de software en múltiples industrias. Me desenvuelvo bien en entornos dinámicos y de ritmo rápido y disfruto siendo parte de equipos que valoran la responsabilidad, la propiedad y la mejora continua. Soy automotivado, curioso y un aprendiz rápido, siempre entusiasta por adquirir nuevas habilidades y explorar mejores formas de lograr objetivos comerciales, mientras mantengo un buen sentido del humor.",
    "profile.description1":"Más allá de mi formación técnica, soy un experto en ayudar a las empresas a modernizar sus operaciones y avanzar exitosamente hacia 2026 y más allá. Me especializo en guiar a las organizaciones a través de iniciativas de transformación digital que mejoran los procesos internos, optimizan la productividad y permiten un uso más inteligente de TI, IA y tecnologías emergentes. Ayudo a las empresas a adoptar la tecnología estratégicamente, no solo para innovar, sino para producir más, trabajar mejor y crear valor medible a través de la automatización inteligente, la toma de decisiones basada en datos y experiencias de usuario bien diseñadas.",
    "profile.description2":"Soy un solucionador de problemas con una mentalidad fuerte de \"hacer que las cosas se hagan\", profundamente enfocado en la satisfacción del cliente y el impacto comercial. Traigo una base sólida en principios de programación, Inteligencia de Negocios y arquitectura de software moderna. Altamente adaptable, sé cuándo liderar con nuevas ideas y cuándo dar un paso atrás y apoyar las mejores ideas de otros. Tengo fuertes habilidades analíticas y de resolución de problemas y una capacidad probada para resolver desafíos técnicos complejos de manera eficiente. Como profesional principalmente autodidacta, aprendo continuamente nuevos lenguajes, frameworks y metodologías, aplicando siempre principios SOLID, arquitectura limpia y patrones de diseño probados.",
    "profile.description3":"Considero la TI como mi vocación más que simplemente mi profesión. Mi experiencia abarca desarrollo full-stack, aplicaciones móviles, arquitectura de software, servicios en la nube y la integración inteligente de IA y automatización en flujos de trabajo comerciales del mundo real.",
    "profile.description4":"A lo largo de mi carrera, he adquirido una amplia experiencia en diversas industrias, incluyendo aerolíneas, música, educación, energía, telecomunicaciones, deportes, moda, hospitalidad, redes sociales y viajes. He trabajado en roles presenciales y remotos, como freelancer y contratista, en startups, pequeñas empresas y grandes consultorías multinacionales. Mis roles han incluido arquitecto de software, líder de equipo desarrollador y desarrollador senior, actuando a menudo como puente entre equipos técnicos y interesados comerciales. Gracias por su tiempo y consideración. Me gustaría tener la oportunidad de discutir cómo mi experiencia en ingeniería de software, transformación digital y uso inteligente de la tecnología podría apoyar y mejorar los procesos y objetivos futuros de su organización. No dude en contactarme en goodbytes23@gmail.com para cualquier información adicional. He adjuntado mi currículum a continuación para más detalles sobre mi experiencia.",
    "profile.signature":"Saludos cordiales,",
    "profile.strongPointsTitle":"Puntos",
    "profile.strongPointsSubtitle":"Fuertes",
    "profile.strongPoint1":"+20 años de experiencia en la industria de TI.",
    "profile.strongPoint2":"Trabajando con full stack, front end, back end, bases de datos y aplicaciones móviles.",
    "profile.strongPoint3":"Experiencia trabajando solo, como miembro de un equipo o liderando un proyecto.",
    "profile.strongPoint4":"Experiencia obtenida trabajando en muchas áreas diferentes en varias empresas dentro de diversas industrias.",
    "profile.strongPoint5":"Persona automotivada, curiosa, segura de sí misma y con rápida capacidad de aprendizaje.",
    "contact.name":"Nombre",
    "contact.email":"Correo electrónico",
    "contact.company":"Empresa",
    "contact.message":"Mensaje",
    "contact.send":"Enviar",
    "contact.sending":"Enviando...",
    "contact.successTitle":"¡Mensaje Enviado!",
    "contact.successMessage":"Gracias por tu mensaje. Me pondré en contacto contigo pronto.",
    "contact.details":"Detalles de contacto",
    "contact.emailLabel":"Correo electrónico",
    "contact.city":"Ciudad"
}